sys390-isa.tex
% Created 2015-09-01 Tue 18:13
\documentclass{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{booktabs}
\usepackage[margin=1.5in]{geometry}
\usepackage{lastpage}
\usepackage{fancyhdr}
\pagestyle{fancy}
\lhead{SYS 390---Information Systems Analysis}
\chead{}
\rhead{Course Syllabus}
\lfoot{Fall 2015}
\cfoot{}
\rfoot{Page \thepage\ of \pageref{LastPage}}
\renewcommand{\headrulewidth}{0.4pt}
\renewcommand{\footrulewidth}{0.4pt}
\renewcommand\maketitle\relax
\date{Fall, 2015}
\title{SYS 390---Information Systems Analysis}
\hypersetup{
 pdfauthor={Tom Nurkkala},
 pdftitle={SYS 390---Information Systems Analysis},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.5.1 (Org mode 8.3.1)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Instructor}
\label{sec:orgheadline1}
\textbf{Dr. Tom Nurkkala}\\
Associate Professor, Computer Science and Engineering\\
Director, Center for Missions Computing\\
Office: Euler Science 211\\
E-Mail: \texttt{tnurkkala@cse.taylor.edu}\\
Phone: 765/998-5163\\
Hours: MW 2:00-4:00, TR 1:00-2:00

\section{Course Overview}
\label{sec:orgheadline2}
In this course, you will acquire knowledge and develop skills
that will allow you to \emph{define} and \emph{analyze} an information system
using a \emph{software development methodology}.
You will
undertake requirements analysis,
create data and process models,
design a user interface
and model user experience.
You will create a business proposal for an external customer's system,
and develop a comprehensive specification that meets the customer's requirements.
Your work in this course will be continued and completed in
SYS 394, Information Systems Design.

\section{Learning Objectives}
\label{sec:orgheadline3}
Upon successful completion of this course, you should be able to:

\begin{itemize}
\item Explain and apply the four absolutes of quality management
\item Explain the importance of knowing the business to successful systems analysis
\item Explain how project success depends on intelligent use of a software development
methodology
\item Explain how system requirements and quality are related
\item Evaluate the return on investment of a project to assure real business value
\item Explain the role of information technology in business process re-engineering
\item Use Kepner-Tregoe decision analysis
\item Write well-posed requirements
\item Use a system response table to define project scope and decompose a system
\item Create use-cases that detail the user-focused capabilities of a system
\item Perform logical data modeling
\item Perform user experience modeling for a complex business application
\item Create wireframe mock-ups of an application
\end{itemize}

\section{Text}
\label{sec:orgheadline4}
There is no required text for the class.
\section{Systems Analysis Project}
\label{sec:orgheadline7}
The emphasis in this course is to \emph{learn} systems analysis by \emph{doing} systems analysis.
\subsection{Written Deliverables}
\label{sec:orgheadline5}
Working with an external client,
you and your team
will analyze the client's business requirements
and produce two written deliverables:
\begin{enumerate}
\item A \emph{business proposal} (BP) that presents an analysis
of the client's business requirements
and enumerates proposed systems
that address those requirements.
A typical proposal
offers both ``build'' and ``buy'' solutions,
including a net-present-value analysis of each proposed solution.
Based on several criteria (covered in class),
your team will recommend the best solution for the client.
\item A \emph{system requirements specification} (SRS)
that details a custom-built solution for the client's business requirements.
In a commercial context, of course,
you would only create an SRS
if the business analysis recommended a ``build'' solution.
However, because creating an SRS is a key learning outcome of ISA,
you will create the SRS \emph{regardless} of the recommendation in your business proposal.
\end{enumerate}
Your SRS will form the basis for building a working prototype of the system
that you will develop in SYS 394 (ISD) during the spring term.
\subsection{Formal Presentation}
\label{sec:orgheadline6}
Your team will make a formal presentation of the your BP and SRS at the end
of the semester. The client is invited to attend your presentation. If the client is
unable to attend, I will stand in as a client proxy.

You are expected to arrive in business attire, make a professional quality presentation,
provide slides and handouts as required, and deliver high-quality printed copies of the
business proposal and SRS. Your team should be prepared to interact vigorously with the
client (or faculty proxy) to explain, clarify, and defend your analysis, proposal, and
SRS.

\newpage
\section{Evaluation}
\label{sec:orgheadline10}

The grading breakdown for the course is as follows:
\begin{center}
\begin{tabular}{llllll}
\hline
Homework &  &  &  &  & 15\%\\
\hline
Project &  &  &  &  & 40\%\\
 & Prelim Deliverables &  &  & 10\% & \\
 & Final Deliverables &  &  & 70\% & \\
 &  & BP & 30\% &  & \\
 &  & SRS & 70\% &  & \\
 & Presentation &  &  & 20\% & \\
 &  & Individual & 20\% &  & \\
 &  & Team & 80\% &  & \\
\hline
Exams &  &  &  &  & 45\%\\
 & Midterm 1 &  &  & 33\% & \\
 & Midterm 2 &  &  & 33\% & \\
 & Final (or project score) &  &  & 33\% & \\
\hline
\end{tabular}
\end{center}
Refer to my \emph{Periodic Table of the Grades} (on Moodle) for the grading scheme. I reserve
the right to award a higher grade than strictly earned; outstanding attendance and class
participation figure prominently in such decisions.
\subsection{Performance Appraisal}
\label{sec:orgheadline8}
Early in the semester, your team will agree on a team performance appraisal.
The performance appraisal lists criteria (e.g., ``attends team meetings,''
``delivers on commitments'') by which you will evaluate each team member
at the end of the term.
Prior to your final presentation,
you will meet face-to-face as a team to evaluate one another according to these criteria.
Your team will submit your completed performance appraisal
at the time of your final presentation.

The performance appraisal is the key mechanism
by which you can hold fellow team members accountable to execute on the team project.
Although I evaluate the project on its merits,
the results of the appraisal determine how I apportion project credit
to each team member.
In other words,
I determine the size of the pie (total project points),
but you determine how the pie is sliced (individual point distribution)
\subsection{Final Exam}
\label{sec:orgheadline9}
You may elect to take a final exam for the course.
However, you may elect to use your individual score from the team
project as your final exam score.

Most teams do well on the project.
Consequently, very few students elect to take the final exam.
Why offer this option? Consider these illustrative scenarios:
\begin{itemize}
\item You're concerned that your project will not receive high marks
(e.g., everyone else on your team spent way too much time rehearsing for Air Band).
Doing well on the final could improve your grade in the course.
\item A team member (call him \emph{Tom}) deserves a low score on the performance appraisal.
As a graceful colleague, you're hesitant to evaluate Tom accurately
because doing so will ``cause'' him to get a low overall course grade.
However, because Tom could take the final and attempt to raise his grade,
you're more willing to give honest feedback (benefiting Tom in the long run!).
\end{itemize}

Note the following regarding the final exam:
\begin{itemize}
\item Projects are submitted at the end of the semester
and are large and complex to grade.
You will \emph{not} have your final project grade
before you have to decide whether or not to take the final.
\item Because few take the exam, it's normally conducted as an oral exam.
\end{itemize}
\section{Course Expectations}
\label{sec:orgheadline15}
Following are my expectations regarding the course.
\subsection{Attendance}
\label{sec:orgheadline11}
You are required to attend all class sessions.
I will be in class each day, and I expect you to be there also.

In general, I am very understanding about students who must miss class
due to a sanctioned Taylor activity, medical appointment, job interview,
family emergency, and the like.
If possible, let me know in advance that you will not be in class;
I will work with you to arrange make-up instruction, homework, exams, etc.
\subsection{Late Work}
\label{sec:orgheadline12}
All course assignments will include an unambiguous due date.
Barring exceptional circumstances like those mentioned in section \ref{sec:orgheadline11},
I expect your work to be submitted \emph{on the due date}.
Late work will \emph{not} be accepted.

This policy on late work is intended to prepare you
for real-world experience after graduation.
In the marketplace,
late work is not merely an inconvenience.
Missing a deadline may
alienate your customer,
upset your manager,
ruin your project,
or terminate your employment!
\emph{Now} is the time to learn the self discipline and time management skills
required to complete your work when it is due.
\subsection{Conduct}
\label{sec:orgheadline13}
I expect you to be prepared, awake, aware, and participatory during class. I will not
hesitate to ask you to stand or move if you are distracted or sleepy.

I expect you to join in discussions, respond to questions from me and from your
colleagues, and ask questions of me. I expect you to hold my feet to the fire if I am
being unclear, unkind, or contradictory.
\subsection{Gizmos}
\label{sec:orgheadline14}
You may not use a laptop, tablet, or similar device to check e-mail, engage in social
networking, surf the web, or any other activity not directly relevant
to current classroom activity.
If you use an electronic gizmo during class for legitimate academic purposes
(e.g., note taking), be prepared to demonstrate relevant use on demand
at any time.
\section{Moodle}
\label{sec:orgheadline16}
The Computer Science and Engineering department uses Moodle as our Learning Management
System. The URL for Moodle is \url{https://moodle.cse.taylor.edu}. To sign on to the course site
for the first time, you will need an enrollment key. The key for this course is
\texttt{nerds4christ}.

You are responsible for checking Moodle regularly to keep up with assignment due dates and
other announcements posted to the site. For due dates, the Moodle calendar is your friend.
\section{Academic Integrity}
\label{sec:orgheadline17}
As a student at an institution whose goal is to honor Christ in all that it does,
I expect you to uphold the strictest standards of academic integrity.
You must do your own work, cite others when you present their work,
and never misrepresent your academic performance in any way.
Violation of these standards stains the reputations of you as a student,
Taylor as an institution,
and Jesus as our Lord.
Such a violation may result in your failing the course
and other disciplinary action by the University.
Refer to the Taylor catalog for the official statement of these ideas.
\end{document}